Revit 2027 API
TopographySurface.IsAssociatedWithBuildingPad Property
 Identifies if this element represents a topography surface associated with a building pad.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsAssociatedWithBuildingPad { get; }
Public ReadOnly Property IsAssociatedWithBuildingPad As Boolean
	Get
public:
property bool IsAssociatedWithBuildingPad {
	bool get ();
}
member IsAssociatedWithBuildingPad : bool with get
Property Value
Boolean
See Also
Reference
TopographySurface Class
Autodesk.Revit.DB.Architecture Namespace